function solution(n,a,b) {
    let round = 0;
    
    while(a !== b){           //a,b번 참가자의 각각의 대진매치팀 구하기! 매치팀이 같지않으면 계속반복
        a = Math.ceil(a/2)      //a대진매치: 대진은 2명씩이뤄지므로 라운드가 증가하면 절반씩 나눈다.
        b = Math.ceil(b/2)      //짝수일땐 나머지가 0으로 딱나눠지지만, 홀수번째 사람이면 소수점이 붙는다.
                                //소수점이 생기면 올려버리는 ceil 사용해서 매치팀을 계속해서 넣는다.
        round++
    }
    return round;    
}

    
    
    
    

/* round = 1;
 대진매치   1팀   2팀  3팀  4팀     
 총원 8명 [1,2][3,4][5,6][7,8]
                나      경쟁자
 대진은 2명씩, 따라서 대진매치 팀을 구하려면, 참가번호/2 한다.
 짝수는 0으로 딱나눠떨어져서 괜찮은데, 홀수참가자는 몫에서 올림해줘야 해당 매치팀이 나온다.
                               
round = 2;
대진매치   1팀   2팀
총원 n/2 [1,4][5,7]

round= 3;
         1팀
총원 n/2 [4,7]
return round; */

