function solution(array, commands) {
    
    return commands.map((cmd) => {  //[2,5,3] [4,4,1] [1,7,3] 를 3번째 값의 새로운 배열로 맵핑예정
    const newArr = array            //[1,5,2,6,3,7,4] 배열을 새로운 변수에 할당
        .slice(cmd[0]-1, cmd[1])
                //slice(시작, 끝 미포함) => 새로운 배열객체 리턴 원본변경x
    //2부터 5까지+1(미포함이니깐)인 줄 알았는데 문제는 0번째 부터 시작이 아니라, 1번째를 배열의 시작으로 보았음
    //배열을 1부터 시작한다고 보고 slice의 시작점에 -1 해줌.
    
        .sort((a, b) => a - b);   //오름차순정렬 [5,2,6,3] --> [2,3,5,6] 중에 3번째 값으로 리턴
        return newArr[cmd[2] - 1];
  });
}

